zlun10/example_code/chip/cw32l011/StdDriver/inc/cw32l011_sysctrl.h
/**
 * @file cw32l011_sysctrl.h
 * @author WHXY
 * @brief
 * @version 0.1
 * @date 2022-7-12
 *
 * @copyright Copyright (c) 2022
 *
 */
/*******************************************************************************
 *
 * 代码许可和免责信息
 * 武汉芯源半导体有限公司授予您使用所有编程代码示例的非专属的版权许可，您可以由此
 * 生成根据您的特定需要而定制的相似功能。根据不能被排除的任何法定保证，武汉芯源半
 * 导体有限公司及其程序开发商和供应商对程序或技术支持（如果有）不提供任何明示或暗
 * 含的保证或条件，包括但不限于暗含的有关适销性、适用于某种特定用途和非侵权的保证
 * 或条件。
 * 无论何种情形，武汉芯源半导体有限公司及其程序开发商或供应商均不对下列各项负责，
 * 即使被告知其发生的可能性时，也是如此：数据的丢失或损坏；直接的、特别的、附带的
 * 或间接的损害，或任何后果性经济损害；或利润、业务、收入、商誉或预期可节省金额的
 * 损失。
 * 某些司法辖区不允许对直接的、附带的或后果性的损害有任何的排除或限制，因此某些或
 * 全部上述排除或限制可能并不适用于您。
 *
 *******************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __CW32L011_SYSCTRL_H
#define __CW32L011_SYSCTRL_H

#ifdef __cplusplus
extern "C"
{
#endif

/* Includes ------------------------------------------------------------------*/
#include "system_cw32l011.h"

    typedef enum
    {
        // AHB
        SysctrlPeriphFLASH = SYSCTRL_AHBEN_FLASH_Msk,
        SysctrlPeriphCRC = SYSCTRL_AHBEN_CRC_Msk,
        SysctrlPeriphGPIOA = SYSCTRL_AHBEN_GPIOA_Msk,
        SysctrlPeriphGPIOB = SYSCTRL_AHBEN_GPIOB_Msk,
        SysctrlPeriphGPIOC = SYSCTRL_AHBEN_GPIOC_Msk,
        // APB1
        SysctrlPeriphADC = SYSCTRL_APBEN1_ADC_Msk << 8,
        SysctrlPeriphVC = SYSCTRL_APBEN1_VC_Msk << 8,
        SysctrlPeriphSPI1 = SYSCTRL_APBEN1_SPI1_Msk << 8,
        SysctrlPeriphUART1 = SYSCTRL_APBEN1_UART1_Msk << 8,
        SysctrlPeriphUART2 = SYSCTRL_APBEN1_UART2_Msk << 8,
        SysctrlPeriphATIM = SYSCTRL_APBEN1_ATIM_Msk << 8,
        SysctrlPeriphGTIM1 = SYSCTRL_APBEN1_GTIM1_Msk << 8,
        SysctrlPeriphGTIM2 = SYSCTRL_APBEN1_GTIM2_Msk << 8,
        SysctrlPeriphUART3 = SYSCTRL_APBEN1_UART3_Msk << 8,
        // APB2
        SysctrlPeriphRTC = SYSCTRL_APBEN2_RTC_Msk << 16,
        SysctrlPeriphBTIM123 = SYSCTRL_APBEN2_BTIM123_Msk << 16,
        SysctrlPeriphIWDT = SYSCTRL_APBEN2_IWDT_Msk << 16,
        SysctrlPeriphI2C = SYSCTRL_APBEN2_I2C_Msk << 16,
        SysctrlPeriphLPTIM = SYSCTRL_APBEN2_LPTIM_Msk << 16
    } SYSCTRL_PeriphEnumTypeDef;

    typedef enum
    {
        RESETFLAG_POR = (1 << 0),        // 上电复位 / 掉电复位标志
        RESETFLAG_LVD = (1 << 3),        // LVD 复位标志
        RESETFLAG_IWDT = (1 << 4),       // IWDT 复位标志
        RESETFLAG_RSTB = (1 << 6),       // NRST 引脚复位标志
        RESETFLAG_LOCKUP = (1 << 8),     // LOCKUP 故障复位标志
        RESETFLAG_SYSRESETREQ = (1 << 9) // 内核 SYSRESETREQ 复位标志
    } SYSCTRL_ResetFlagTypeDef;
//==================================================================================
#if !defined(HSE_VALUE)
#define HSE_VALUE ((uint32_t)16000000) /*!< Value of the External oscillator in Hz */
#endif

#if !defined(HSIOSC_VALUE)
#define HSIOSC_VALUE ((uint32_t)96000000) /*!< Value of the Internal High Speed oscillator in Hz. \
                                            The real value may vary depending on the variations   \
                                            in voltage and temperature.  */
#endif

#if !defined(LSI_VALUE)
#define LSI_VALUE ((uint32_t)32800) /*!< Value of the Internal Low Speed oscillator in Hz    \
                                         The real value may vary depending on the variations \
                                         in voltage and temperature.  */
#endif

#if !defined(LSE_VALUE)
#define LSE_VALUE ((uint32_t)32768) /*!< Value of the External Low Speed oscillator in Hz */
#endif

/* SYSCTRL CR0 --------------------------------------------------------*/
#define SYSCTRL_KEY (0x5A5A0000U)
#define SYSCTRL_KEY_MASK (0xFFFF0000U)
#define SYSCTRL_KEY_MASK_INV (0x0000FFFFU)

#define SYSCTRL_HCLK_DIV1 (0x0UL << SYSCTRL_CR0_HCLKPRS_Pos)   /*!< SYSCLK not divided */
#define SYSCTRL_HCLK_DIV2 (0x1UL << SYSCTRL_CR0_HCLKPRS_Pos)   /*!< SYSCLK divided by 2 */
#define SYSCTRL_HCLK_DIV4 (0x2UL << SYSCTRL_CR0_HCLKPRS_Pos)   /*!< SYSCLK divided by 4 */
#define SYSCTRL_HCLK_DIV8 (0x3UL << SYSCTRL_CR0_HCLKPRS_Pos)   /*!< SYSCLK divided by 8 */
#define SYSCTRL_HCLK_DIV16 (0x4UL << SYSCTRL_CR0_HCLKPRS_Pos)  /*!< SYSCLK divided by 16 */
#define SYSCTRL_HCLK_DIV32 (0x5UL << SYSCTRL_CR0_HCLKPRS_Pos)  /*!< SYSCLK divided by 32 */
#define SYSCTRL_HCLK_DIV64 (0x6UL << SYSCTRL_CR0_HCLKPRS_Pos)  /*!< SYSCLK divided by 64 */
#define SYSCTRL_HCLK_DIV128 (0x7ul << SYSCTRL_CR0_HCLKPRS_Pos) /*!< SYSCLK divided by 128 */
#define IS_SYSCTRL_HCLKPRS(INSTANCE) (((INSTANCE) == SYSCTRL_HCLK_DIV1) ||  \
                                      ((INSTANCE) == SYSCTRL_HCLK_DIV2) ||  \
                                      ((INSTANCE) == SYSCTRL_HCLK_DIV4) ||  \
                                      ((INSTANCE) == SYSCTRL_HCLK_DIV8) ||  \
                                      ((INSTANCE) == SYSCTRL_HCLK_DIV16) || \
                                      ((INSTANCE) == SYSCTRL_HCLK_DIV32) || \
                                      ((INSTANCE) == SYSCTRL_HCLK_DIV64) || \
                                      ((INSTANCE) == SYSCTRL_HCLK_DIV128))

#define SYSCTRL_PCLK_DIV1 (0x0UL << SYSCTRL_CR0_PCLKPRS_Pos) /*!< HCLK not divided */
#define SYSCTRL_PCLK_DIV2 (0x1UL << SYSCTRL_CR0_PCLKPRS_Pos) /*!< HCLK divided by 2 */
#define SYSCTRL_PCLK_DIV4 (0x2UL << SYSCTRL_CR0_PCLKPRS_Pos) /*!< HCLK divided by 4 */
#define SYSCTRL_PCLK_DIV8 (0x3UL << SYSCTRL_CR0_PCLKPRS_Pos) /*!< HCLK divided by 8 */
#define IS_SYSCTRL_PCLKPRS(INSTANCE) (((INSTANCE) == SYSCTRL_PCLK_DIV1) || \
                                      ((INSTANCE) == SYSCTRL_PCLK_DIV2) || \
                                      ((INSTANCE) == SYSCTRL_PCLK_DIV4) || \
                                      ((INSTANCE) == SYSCTRL_PCLK_DIV8))

#define SYSCTRL_SYSCLKSRC_HSI (0x00000000U) /*!< HSI selected as system clock */
#define SYSCTRL_SYSCLKSRC_HSE (0x00000001U) /*!< HSE selected as system clock */
#define SYSCTRL_SYSCLKSRC_LSI (0x00000003U) /*!< LSI selected as system clock */
#define SYSCTRL_SYSCLKSRC_LSE (0x00000004U) /*!< LSE selected as system clock */
#define IS_SYSCTRL_SYSCLKSRC(INSTANCE) (((INSTANCE) == SYSCTRL_SYSCLKSRC_HSI) || \
                                        ((INSTANCE) == SYSCTRL_SYSCLKSRC_HSE) || \
                                        ((INSTANCE) == SYSCTRL_SYSCLKSRC_LSI) || \
                                        ((INSTANCE) == SYSCTRL_SYSCLKSRC_LSE))

/* SYSCTRL CR1 --------------------------------------------------------*/
#define SYSCTRL_HSIEN SYSCTRL_CR1_HSIEN_Msk
#define SYSCTRL_HSEEN SYSCTRL_CR1_HSEEN_Msk
#define SYSCTRL_LSIEN SYSCTRL_CR1_LSIEN_Msk
#define SYSCTRL_LSEEN SYSCTRL_CR1_LSEEN_Msk
#define SYSCTRL_LSELOCKEN SYSCTRL_CR1_LSELOCK_Msk
#define SYSCTRL_LSELOCKDIS 0x00UL
#define IS_SYSCTRL_LSELOCK_STATUS(INSTANCE) (((INSTANCE) == SYSCTRL_LSELOCKEN) || \
                                             ((INSTANCE) == SYSCTRL_LSELOCKDIS))

