zlun10/example_code/chip/cw32l011/StdDriver/inc/cw32l011_sysctrl.h
#define SYSCTRL_LSECCSEN SYSCTRL_CR1_LSECCS_Msk
#define SYSCTRL_HSECCSEN SYSCTRL_CR1_HSECCS_Msk
#define SYSCTRL_CLKCCSEN SYSCTRL_CR1_CLKCCS_Msk
#define IS_SYSCTRL_CCS_STATUS(INSTANCE) (((INSTANCE) == SYSCTRL_LSECCSEN) || \
                                         ((INSTANCE) == SYSCTRL_HSECCSEN) || \
                                         ((INSTANCE) == SYSCTRL_CLKCCSEN))

/* SYSCTRL CR2 --------------------------------------------------------*/
#define SYSCTRL_RAMBRKEN SYSCTRL_CR2_RAMBRKEN_Msk
#define SYSCTRL_LVDBRKEN SYSCTRL_CR2_LVDBRKEN_Msk
#define SYSCTRL_DSBRKEN SYSCTRL_CR2_DSBRKEN_Msk
#define SYSCTRL_LOCKUPBRKEN SYSCTRL_CR2_LOCKUP_Msk
#define SYSCTRL_LSEBRKEN SYSCTRL_CR2_LSEBRKEN_Msk
#define SYSCTRL_HSEBRKEN SYSCTRL_CR2_HSEBRKEN_Msk
#define SYSCTRL_RTC_LOWPOWEREN SYSCTRL_CR2_RTCLPM_Msk
#define SYSCTRL_FLASHWAIT_24M (0x00UL)
#define SYSCTRL_FLASHWAIT_48M (0x01UL << SYSCTRL_CR2_FLASHWAIT_Pos)
#define SYSCTRL_FLASHWAIT_72M (0x02UL << SYSCTRL_CR2_FLASHWAIT_Pos)
#define SYSCTRL_FLASHWAIT_96M (0x03UL << SYSCTRL_CR2_FLASHWAIT_Pos)
#define IS_SYSCTRL_FLASHWAIT_VALUE(VAL) (((VAL) == SYSCTRL_FLASHWAIT_24M) || \
                                         ((VAL) == SYSCTRL_FLASHWAIT_48M) || \
                                         ((VAL) == SYSCTRL_FLASHWAIT_72M) || \
                                         ((VAL) == SYSCTRL_FLASHWAIT_96))

#define __SYSCTRL_FLASHWAT_1HCLK() (CW_SYSCTRL->CR2 = (CW_SYSCTRL->CR2 & (~SYSCTRL_CR2_FLASHWAIT_Msk)) | SYSCTRL_KEY | SYSCTRL_FLASHWAIT_24M)
#define __SYSCTRL_FLASHWAT_2HCLK() (CW_SYSCTRL->CR2 = (CW_SYSCTRL->CR2 & (~SYSCTRL_CR2_FLASHWAIT_Msk)) | SYSCTRL_KEY | SYSCTRL_FLASHWAIT_48M)
#define __SYSCTRL_FLASHWAT_3HCLK() (CW_SYSCTRL->CR2 = (CW_SYSCTRL->CR2 & (~SYSCTRL_CR2_FLASHWAIT_Msk)) | SYSCTRL_KEY | SYSCTRL_FLASHWAIT_72M)
#define __SYSCTRL_FLASHWAT_4HCLK() (CW_SYSCTRL->CR2 = (CW_SYSCTRL->CR2 & (~SYSCTRL_CR2_FLASHWAIT_Msk)) | SYSCTRL_KEY | SYSCTRL_FLASHWAIT_96M)
#define SYSCTRL_WAKEUPCLKEN SYSCTRL_CR2_WAKEUPCLK_Msk
#define SYSCTRL_WAKEUPCLKDIS 0x00UL
#define IS_SYSCTRL_WAKEUPCLK_STATUS(INSTANCE) (((INSTANCE) == SYSCTRL_WAKEUPCLKEN) || \
                                               ((INSTANCE) == SYSCTRL_WAKEUPCLKDIS))

#define SYSCTRL_LOCKUPEN SYSCTRL_CR2_LOCKUP_Msk
#define SYSCTRL_LOCKUPDIS 0x00UL
#define IS_SYSCTRL_LOCKUP_STATUS(INSTANCE) (((INSTANCE) == SYSCTRL_LOCKUPEN) || \
                                            ((INSTANCE) == SYSCTRL_LOCKUPDIS))

#define SYSCTRL_SWDIOEN 0x00UL
#define SYSCTRL_SWDIODIS SYSCTRL_CR2_SWDIO_Msk
#define IS_SYSCTRL_SWDIO_STATUS(INSTANCE) (((INSTANCE) == SYSCTRL_SWDIOEN) || \
                                           ((INSTANCE) == SYSCTRL_SWDIODIS))

#define SYSCTRL_RSTIOEN 0x00UL
#define SYSCTRL_RSTIODIS SYSCTRL_CR2_RSTIO_Msk

/* SYSCTRL HSI --------------------------------------------------------*/
#if !defined(SYSCTRL_HSI_TRIMCODEADDR)
#define SYSCTRL_HSI_TRIMCODEADDR (0x001007C0U) //
#endif

#define SYSCTRL_HSIOSC_DIV1 ((uint32_t)(1UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV2 ((uint32_t)(2UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV3 ((uint32_t)(3UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV4 ((uint32_t)(4UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV5 ((uint32_t)(5UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV6 ((uint32_t)(6UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV7 ((uint32_t)(7UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV8 ((uint32_t)(8UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV9 ((uint32_t)(9UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV10 ((uint32_t)(10UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV12 ((uint32_t)(11UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV16 ((uint32_t)(12UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV20 ((uint32_t)(13UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV24 ((uint32_t)(14UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV28 ((uint32_t)(15UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV32 ((uint32_t)(0UL))

#define HSIOSC_TO_HSI96MHZ SYSCTRL_HSIOSC_DIV1
#define HSIOSC_TO_HSI48MHZ SYSCTRL_HSIOSC_DIV2
#define HSIOSC_TO_HSI32MHZ SYSCTRL_HSIOSC_DIV3
#define HSIOSC_TO_HSI24MHZ SYSCTRL_HSIOSC_DIV4
#define HSIOSC_TO_HSI19P2MHZ SYSCTRL_HSIOSC_DIV5
#define HSIOSC_TO_HSI16MHZ SYSCTRL_HSIOSC_DIV6
#define HSIOSC_TO_HSI13P7MHZ SYSCTRL_HSIOSC_DIV7
#define HSIOSC_TO_HSI12MHZ SYSCTRL_HSIOSC_DIV8
#define HSIOSC_TO_HSI10P6MHZ SYSCTRL_HSIOSC_DIV9
#define HSIOSC_TO_HSI9P6MHZ SYSCTRL_HSIOSC_DIV10
#define HSIOSC_TO_HSI8MHZ SYSCTRL_HSIOSC_DIV12
#define HSIOSC_TO_HSI6MHZ SYSCTRL_HSIOSC_DIV16
#define HSIOSC_TO_HSI4P8MHZ SYSCTRL_HSIOSC_DIV20
#define HSIOSC_TO_HSI4MHZ SYSCTRL_HSIOSC_DIV24
#define HSIOSC_TO_HSI3P4MHZ SYSCTRL_HSIOSC_DIV28
#define HSIOSC_TO_HSI3MHZ SYSCTRL_HSIOSC_DIV32

#define IS_SYSCTRL_HSIOSC_DIV(INSTANCE) (((INSTANCE) == SYSCTRL_HSIOSC_DIV1) ||  \
                                         ((INSTANCE) == SYSCTRL_HSIOSC_DIV2) ||  \
                                         ((INSTANCE) == SYSCTRL_HSIOSC_DIV3) ||  \
                                         ((INSTANCE) == SYSCTRL_HSIOSC_DIV4) ||  \
                                         ((INSTANCE) == SYSCTRL_HSIOSC_DIV5) ||  \
                                         ((INSTANCE) == SYSCTRL_HSIOSC_DIV6) ||  \
                                         ((INSTANCE) == SYSCTRL_HSIOSC_DIV7) ||  \
                                         ((INSTANCE) == SYSCTRL_HSIOSC_DIV8) ||  \
                                         ((INSTANCE) == SYSCTRL_HSIOSC_DIV9) ||  \
                                         ((INSTANCE) == SYSCTRL_HSIOSC_DIV10) || \
                                         ((INSTANCE) == SYSCTRL_HSIOSC_DIV12) || \
                                         ((INSTANCE) == SYSCTRL_HSIOSC_DIV16) || \
                                         ((INSTANCE) == SYSCTRL_HSIOSC_DIV20) || \
                                         ((INSTANCE) == SYSCTRL_HSIOSC_DIV24) || \
                                         ((INSTANCE) == SYSCTRL_HSIOSC_DIV28) || \
                                         ((INSTANCE) == SYSCTRL_HSIOSC_DIV32))

/* SYSCTRL LSI --------------------------------------------------------*/
#if !defined(SYSCTRL_LSI_TRIMCODEADDR)
#define SYSCTRL_LSI_TRIMCODEADDR (0x001007C2U) //
#endif

