zlun10/example_code/chip/cw32l011/StdDriver/inc/cw32l011_sysctrl.h
#define IS_SYSCTRL_LSE_DRIVER(DRIVER) ((DRIVER) < 0x10)

/* SYSCTRL ISR  --------------------------------------------------------*/
#define SYSCTRL_FLAG_LSESTABLE bv15
#define SYSCTRL_FLAG_LSISTABLE bv14
#define SYSCTRL_FLAG_HSESTABLE bv12
#define SYSCTRL_FLAG_HSISTABLE bv11
#define IS_SYSCTRL_STABLEFLAG(FLAG) (((FLAG) == SYSCTRL_FLAG_HSISTABLE) || ((FLAG) == SYSCTRL_FLAG_HSESTABLE) || \
                                     ((FLAG) == SYSCTRL_FLAG_LSESTABLE) || ((FLAG) == SYSCTRL_FLAG_LSISTABLE))

#define SYSCTRL_FLAG_HSEFAULT bv8
#define SYSCTRL_FLAG_LSEFAULT bv7
#define SYSCTRL_FLAG_HSEFAIL bv6
#define SYSCTRL_FLAG_LSEFAIL bv5
#define SYSCTRL_FLAG_LSERDY bv4
#define SYSCTRL_FLAG_LSIRDY bv3
#define SYSCTRL_FLAG_HSERDY bv1
#define SYSCTRL_FLAG_HSIRDY bv0

/* SYSCTRL IER ICR  --------------------------------------------------------*/
#define SYSCTRL_IT_HSEFAULT (bv8)
#define SYSCTRL_IT_LSEFAULT (bv7)
#define SYSCTRL_IT_HSEFAIL (bv6)
#define SYSCTRL_IT_LSEFAIL (bv5)
#define SYSCTRL_IT_LSERDY (bv4)
#define SYSCTRL_IT_LSIRDY (bv3)
#define SYSCTRL_IT_HSERDY (bv1)
#define SYSCTRL_IT_HSIRDY (bv0)
#define IS_SYSCTRL_IT(IT) ((((IT) & 0xFFFFFFE0) == 0x0UL) && ((IT) != 0x0UL))
#define IS_SYSCTRL_GET_IT(IT) (((IT) == SYSCTRL_IT_LSEFAULT) || \
                               ((IT) == SYSCTRL_IT_LSEFAIL) ||  \
                               ((IT) == SYSCTRL_IT_LSERDY) ||   \
                               ((IT) == SYSCTRL_IT_LSIRDY) ||   \
                               ((IT) == SYSCTRL_IT_HSIRDY))

/* SYSCTRL RESETFLAG  --------------------------------------------------------*/
#define SYSCTRL_RESETFLAG_POR bv0
#define SYSCTRL_RESETFLAG_LVD bv3
#define SYSCTRL_RESETFLAG_IWDT bv4

#define SYSCTRL_RESETFLAG_PIN bv6
#define SYSCTRL_RESETFLAG_LOCKUP bv8
#define SYSCTRL_RESETFLAG_SYSRESETREQ bv9
#define SYSCTRL_RESETFLAG_ALL (bv9 | bv8 | bv6 | bv5 | bv4 | bv3 | bv0)
#define IS_SYSCTRL_RSTFLAG(FLAG) (((FLAG) == SYSCTRL_RESETFLAG_POR) || ((FLAG) == SYSCTRL_RESETFLAG_LVD) ||    \
                                  ((FLAG) == SYSCTRL_RESETFLAG_IWDT) ||                                        \
                                  ((FLAG) == SYSCTRL_RESETFLAG_PIN) || ((FLAG) == SYSCTRL_RESETFLAG_LOCKUP) || \
                                  ((FLAG) == SYSCTRL_RESETFLAG_SYSRESETREQ) || ((FLAG) == SYSCTRL_RESETFLAG_ALL))

/* SYSCTRL AHB  --------------------------------------------------------*/
#define SYSCTRL_AHB_PERIPH_GPIOC SYSCTRL_AHBEN_GPIOC_Msk
#define SYSCTRL_AHB_PERIPH_GPIOB SYSCTRL_AHBEN_GPIOB_Msk
#define SYSCTRL_AHB_PERIPH_GPIOA SYSCTRL_AHBEN_GPIOA_Msk
#define SYSCTRL_AHB_PERIPH_CRC SYSCTRL_AHBEN_CRC_Msk
#define SYSCTRL_AHB_PERIPH_FLASH SYSCTRL_AHBEN_FLASH_Msk
#define IS_SYSCTRL_AHB_PERIPH(PERIPH) ((((PERIPH) & 0xFFFFFF89) == 0x00) && ((PERIPH) != 0x00))

#define __SYSCTRL_GPIOC_CLK_ENABLE() REGBITS_SET(CW_SYSCTRL->AHBEN, (SYSCTRL_KEY | SYSCTRL_AHB_PERIPH_GPIOC))
#define __SYSCTRL_GPIOB_CLK_ENABLE() REGBITS_SET(CW_SYSCTRL->AHBEN, (SYSCTRL_KEY | SYSCTRL_AHB_PERIPH_GPIOB))
#define __SYSCTRL_GPIOA_CLK_ENABLE() REGBITS_SET(CW_SYSCTRL->AHBEN, (SYSCTRL_KEY | SYSCTRL_AHB_PERIPH_GPIOA))
#define __SYSCTRL_CRC_CLK_ENABLE() REGBITS_SET(CW_SYSCTRL->AHBEN, (SYSCTRL_KEY | SYSCTRL_AHB_PERIPH_CRC))
#define __SYSCTRL_FLASH_CLK_ENABLE() REGBITS_SET(CW_SYSCTRL->AHBEN, (SYSCTRL_KEY | SYSCTRL_AHB_PERIPH_FLASH))

#define __SYSCTRL_GPIOC_CLK_DISABLE() (CW_SYSCTRL->AHBEN = (SYSCTRL_KEY | (CW_SYSCTRL->AHBEN & (~SYSCTRL_AHB_PERIPH_GPIOC))))
#define __SYSCTRL_GPIOB_CLK_DISABLE() (CW_SYSCTRL->AHBEN = (SYSCTRL_KEY | (CW_SYSCTRL->AHBEN & (~SYSCTRL_AHB_PERIPH_GPIOB))))
#define __SYSCTRL_GPIOA_CLK_DISABLE() (CW_SYSCTRL->AHBEN = (SYSCTRL_KEY | (CW_SYSCTRL->AHBEN & (~SYSCTRL_AHB_PERIPH_GPIOA))))
#define __SYSCTRL_CRC_CLK_DISABLE() (CW_SYSCTRL->AHBEN = (SYSCTRL_KEY | (CW_SYSCTRL->AHBEN & (~SYSCTRL_AHB_PERIPH_CRC))))
#define __SYSCTRL_FLASH_CLK_DISABLE() (CW_SYSCTRL->AHBEN = (SYSCTRL_KEY | (CW_SYSCTRL->AHBEN & (~SYSCTRL_AHB_PERIPH_FLASH))))

#define __SYSCTRL_GPIOC_RST_ENABLE() REGBITS_CLR(CW_SYSCTRL->AHBRST, SYSCTRL_AHBRST_GPIOC_Msk)
#define __SYSCTRL_GPIOB_RST_ENABLE() REGBITS_CLR(CW_SYSCTRL->AHBRST, SYSCTRL_AHBRST_GPIOB_Msk)
#define __SYSCTRL_GPIOA_RST_ENABLE() REGBITS_CLR(CW_SYSCTRL->AHBRST, SYSCTRL_AHBRST_GPIOA_Msk)
#define __SYSCTRL_CRC_RST_ENABLE() REGBITS_CLR(CW_SYSCTRL->AHBRST, SYSCTRL_AHBRST_CRC_Msk)
#define __SYSCTRL_FLASH_RST_ENABLE() REGBITS_CLR(CW_SYSCTRL->AHBRST, SYSCTRL_AHBRST_FLASH_Msk)

#define __SYSCTRL_GPIOC_RST_DISABLE() REGBITS_SET(CW_SYSCTRL->AHBRST, SYSCTRL_AHBRST_GPIOC_Msk)
#define __SYSCTRL_GPIOB_RST_DISABLE() REGBITS_SET(CW_SYSCTRL->AHBRST, SYSCTRL_AHBRST_GPIOB_Msk)
#define __SYSCTRL_GPIOA_RST_DISABLE() REGBITS_SET(CW_SYSCTRL->AHBRST, SYSCTRL_AHBRST_GPIOA_Msk)
#define __SYSCTRL_CRC_RST_DISABLE() REGBITS_SET(CW_SYSCTRL->AHBRST, SYSCTRL_AHBRST_CRC_Msk)
#define __SYSCTRL_FLASH_RST_DISABLE() REGBITS_SET(CW_SYSCTRL->AHBRST, SYSCTRL_AHBRST_FLASH_Msk)

/* SYSCTRL APB1  --------------------------------------------------------*/
#define SYSCTRL_APB1_PERIPH_UART3 SYSCTRL_APBEN1_UART3_Msk
#define SYSCTRL_APB1_PERIPH_GTIM2 SYSCTRL_APBEN1_GTIM2_Msk
#define SYSCTRL_APB1_PERIPH_GTIM1 SYSCTRL_APBEN1_GTIM1_Msk
#define SYSCTRL_APB1_PERIPH_ATIM SYSCTRL_APBEN1_ATIM_Msk
#define SYSCTRL_APB1_PERIPH_UART2 SYSCTRL_APBEN1_UART2_Msk
#define SYSCTRL_APB1_PERIPH_UART1 SYSCTRL_APBEN1_UART1_Msk
#define SYSCTRL_APB1_PERIPH_SPI1 SYSCTRL_APBEN1_SPI1_Msk
#define SYSCTRL_APB1_PERIPH_VC SYSCTRL_APBEN1_VC_Msk
#define SYSCTRL_APB1_PERIPH_ADC SYSCTRL_APBEN1_ADC_Msk
#define IS_SYSCTRL_APB1_PERIPH(PERIPH) ((((PERIPH) & 0xFFFFFE00) == 0x00) && ((PERIPH) != 0x00))
#define __SYSCTRL_UART3_CLK_ENABLE() REGBITS_SET(CW_SYSCTRL->APBEN1, (SYSCTRL_KEY | SYSCTRL_APB1_PERIPH_UART3))
#define __SYSCTRL_GTIM2_CLK_ENABLE() REGBITS_SET(CW_SYSCTRL->APBEN1, (SYSCTRL_KEY | SYSCTRL_APB1_PERIPH_GTIM2))
#define __SYSCTRL_GTIM1_CLK_ENABLE() REGBITS_SET(CW_SYSCTRL->APBEN1, (SYSCTRL_KEY | SYSCTRL_APB1_PERIPH_GTIM1))
#define __SYSCTRL_ATIM_CLK_ENABLE() REGBITS_SET(CW_SYSCTRL->APBEN1, (SYSCTRL_KEY | SYSCTRL_APB1_PERIPH_ATIM))
#define __SYSCTRL_UART2_CLK_ENABLE() REGBITS_SET(CW_SYSCTRL->APBEN1, (SYSCTRL_KEY | SYSCTRL_APB1_PERIPH_UART2))
#define __SYSCTRL_UART1_CLK_ENABLE() REGBITS_SET(CW_SYSCTRL->APBEN1, (SYSCTRL_KEY | SYSCTRL_APB1_PERIPH_UART1))
#define __SYSCTRL_SPI_CLK_ENABLE() REGBITS_SET(CW_SYSCTRL->APBEN1, (SYSCTRL_KEY | SYSCTRL_APB1_PERIPH_SPI1))
#define __SYSCTRL_VC_CLK_ENABLE() REGBITS_SET(CW_SYSCTRL->APBEN1, (SYSCTRL_KEY | SYSCTRL_APB1_PERIPH_VC))
#define __SYSCTRL_ADC_CLK_ENABLE() REGBITS_SET(CW_SYSCTRL->APBEN1, (SYSCTRL_KEY | SYSCTRL_APB1_PERIPH_ADC))

#define __SYSCTRL_UART3_CLK_DISABLE() (CW_SYSCTRL->APBEN1 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN1 & (~SYSCTRL_APB1_PERIPH_UART3))))
#define __SYSCTRL_GTIM2_CLK_DISABLE() (CW_SYSCTRL->APBEN1 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN1 & (~SYSCTRL_APB1_PERIPH_GTIM2))))
#define __SYSCTRL_GTIM1_CLK_DISABLE() (CW_SYSCTRL->APBEN1 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN1 & (~SYSCTRL_APB1_PERIPH_GTIM1))))
#define __SYSCTRL_ATIM_CLK_DISABLE() (CW_SYSCTRL->APBEN1 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN1 & (~SYSCTRL_APB1_PERIPH_ATIM))))
#define __SYSCTRL_UART2_CLK_DISABLE() (CW_SYSCTRL->APBEN1 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN1 & (~SYSCTRL_APB1_PERIPH_UART2))))
#define __SYSCTRL_UART1_CLK_DISABLE() (CW_SYSCTRL->APBEN1 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN1 & (~SYSCTRL_APB1_PERIPH_UART1))))
#define __SYSCTRL_SPI_CLK_DISABLE() (CW_SYSCTRL->APBEN1 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN1 & (~SYSCTRL_APB1_PERIPH_SPI1))))
#define __SYSCTRL_VC_CLK_DISABLE() (CW_SYSCTRL->APBEN1 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN1 & (~SYSCTRL_APB1_PERIPH_VC))))
#define __SYSCTRL_ADC_CLK_DISABLE() (CW_SYSCTRL->APBEN1 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN1 & (~SYSCTRL_APB1_PERIPH_ADC))))

#define __SYSCTRL_UART3_RST_ENABLE() REGBITS_CLR(CW_SYSCTRL->APBRST1, SYSCTRL_APB1_PERIPH_UART3)
#define __SYSCTRL_GTIM2_RST_ENABLE() REGBITS_CLR(CW_SYSCTRL->APBRST1, SYSCTRL_APB1_PERIPH_GTIM2)
#define __SYSCTRL_GTIM1_RST_ENABLE() REGBITS_CLR(CW_SYSCTRL->APBRST1, SYSCTRL_APB1_PERIPH_GTIM1)
#define __SYSCTRL_ATIM_RST_ENABLE() REGBITS_CLR(CW_SYSCTRL->APBRST1, SYSCTRL_APB1_PERIPH_ATIM)
#define __SYSCTRL_UART2_RST_ENABLE() REGBITS_CLR(CW_SYSCTRL->APBRST1, SYSCTRL_APB1_PERIPH_UART2)
#define __SYSCTRL_UART1_RST_ENABLE() REGBITS_CLR(CW_SYSCTRL->APBRST1, SYSCTRL_APB1_PERIPH_UART1)
#define __SYSCTRL_SPI_RST_ENABLE() REGBITS_CLR(CW_SYSCTRL->APBRST1, SYSCTRL_APB1_PERIPH_SPI1)
#define __SYSCTRL_VC_RST_ENABLE() REGBITS_CLR(CW_SYSCTRL->APBRST1, SYSCTRL_APB1_PERIPH_VC)
#define __SYSCTRL_ADC_RST_ENABLE() REGBITS_CLR(CW_SYSCTRL->APBRST1, SYSCTRL_APB1_PERIPH_ADC)

#define __SYSCTRL_UART3_RST_DISABLE() REGBITS_SET(CW_SYSCTRL->APBRST1, SYSCTRL_APB1_PERIPH_UART3)
#define __SYSCTRL_GTIM2_RST_DISABLE() REGBITS_SET(CW_SYSCTRL->APBRST1, SYSCTRL_APB1_PERIPH_GTIM2)
#define __SYSCTRL_GTIM1_RST_DISABLE() REGBITS_SET(CW_SYSCTRL->APBRST1, SYSCTRL_APB1_PERIPH_GTIM1)
#define __SYSCTRL_ATIM_RST_DISABLE() REGBITS_SET(CW_SYSCTRL->APBRST1, SYSCTRL_APB1_PERIPH_ATIM)
#define __SYSCTRL_UART2_RST_DISABLE() REGBITS_SET(CW_SYSCTRL->APBRST1, SYSCTRL_APB1_PERIPH_UART2)
#define __SYSCTRL_UART1_RST_DISABLE() REGBITS_SET(CW_SYSCTRL->APBRST1, SYSCTRL_APB1_PERIPH_UART1)
#define __SYSCTRL_SPI_RST_DISABLE() REGBITS_SET(CW_SYSCTRL->APBRST1, SYSCTRL_APB1_PERIPH_SPI1)
#define __SYSCTRL_VC_RST_DISABLE() REGBITS_SET(CW_SYSCTRL->APBRST1, SYSCTRL_APB1_PERIPH_VC)
#define __SYSCTRL_ADC_RST_DISABLE() REGBITS_SET(CW_SYSCTRL->APBRST1, SYSCTRL_APB1_PERIPH_ADC)

