zlun10/example_code/chip/cw32l011/StdDriver/inc/cw32l011_sysctrl.h
/* SYSCTRL APB2  --------------------------------------------------------*/
#define SYSCTRL_APB2_PERIPH_LPTIM SYSCTRL_APBEN2_LPTIM_Msk
#define SYSCTRL_APB2_PERIPH_I2C SYSCTRL_APBEN2_I2C_Msk
#define SYSCTRL_APB2_PERIPH_IWDT SYSCTRL_APBEN2_IWDT_Msk
#define SYSCTRL_APB2_PERIPH_BTIM123 SYSCTRL_APBEN2_BTIM123_Msk
#define SYSCTRL_APB2_PERIPH_RTC SYSCTRL_APBEN2_RTC_Msk
#define IS_SYSCTRL_APB2_PERIPH(PERIPH) ((((PERIPH) & 0xFFFFFF29) == 0x00) && ((PERIPH) != 0x00))

#define __SYSCTRL_LPTIM_CLK_ENABLE() REGBITS_SET(CW_SYSCTRL->APBEN2, (SYSCTRL_KEY | SYSCTRL_APB2_PERIPH_LPTIM))
#define __SYSCTRL_I2C_CLK_ENABLE() REGBITS_SET(CW_SYSCTRL->APBEN2, (SYSCTRL_KEY | SYSCTRL_APB2_PERIPH_I2C))
#define __SYSCTRL_IWDT_CLK_ENABLE() REGBITS_SET(CW_SYSCTRL->APBEN2, (SYSCTRL_KEY | SYSCTRL_APB2_PERIPH_IWDT))
#define __SYSCTRL_BTIM123_CLK_ENABLE() REGBITS_SET(CW_SYSCTRL->APBEN2, (SYSCTRL_KEY | SYSCTRL_APB2_PERIPH_BTIM123))
#define __SYSCTRL_RTC_CLK_ENABLE() REGBITS_SET(CW_SYSCTRL->APBEN2, (SYSCTRL_KEY | SYSCTRL_APB2_PERIPH_RTC))

#define __SYSCTRL_LPTIM_CLK_DISABLE() (CW_SYSCTRL->APBEN2 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN2 & (~SYSCTRL_APB2_PERIPH_LPTIM))))
#define __SYSCTRL_I2C_CLK_DISABLE() (CW_SYSCTRL->APBEN2 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN2 & (~SYSCTRL_APB2_PERIPH_I2C))))
#define __SYSCTRL_IWDT_CLK_DISABLE() (CW_SYSCTRL->APBEN2 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN2 & (~SYSCTRL_APB2_PERIPH_IWDT))))
#define __SYSCTRL_BTIM123_CLK_DISABLE() (CW_SYSCTRL->APBEN2 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN2 & (~SYSCTRL_APB2_PERIPH_BTIM123))))
#define __SYSCTRL_RTC_CLK_DISABLE() (CW_SYSCTRL->APBEN2 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN2 & (~SYSCTRL_APB2_PERIPH_RTC))))

#define __SYSCTRL_LPTIM_RST_ENABLE() REGBITS_CLR(CW_SYSCTRL->APBRST2, SYSCTRL_APB2_PERIPH_LPTIM)
#define __SYSCTRL_I2C_RST_ENABLE() REGBITS_CLR(CW_SYSCTRL->APBRST2, SYSCTRL_APB2_PERIPH_I2C)
#define __SYSCTRL_IWDT_RST_ENABLE() REGBITS_CLR(CW_SYSCTRL->APBRST2, SYSCTRL_APB2_PERIPH_IWDT)
#define __SYSCTRL_BTIM123_RST_ENABLE() REGBITS_CLR(CW_SYSCTRL->APBRST2, SYSCTRL_APB2_PERIPH_BTIM123)
#define __SYSCTRL_RTC_RST_ENABLE() REGBITS_CLR(CW_SYSCTRL->APBRST2, SYSCTRL_APB2_PERIPH_RTC)

#define __SYSCTRL_LPTIM_RST_DISABLE() REGBITS_SET(CW_SYSCTRL->APBRST2, SYSCTRL_APB2_PERIPH_LPTIM)
#define __SYSCTRL_I2C_RST_DISABLE() REGBITS_SET(CW_SYSCTRL->APBRST2, SYSCTRL_APB2_PERIPH_I2C)
#define __SYSCTRL_IWDT_RST_DISABLE() REGBITS_SET(CW_SYSCTRL->APBRST2, SYSCTRL_APB2_PERIPH_IWDT)
#define __SYSCTRL_BTIM123_RST_DISABLE() REGBITS_SET(CW_SYSCTRL->APBRST2, SYSCTRL_APB2_PERIPH_BTIM123)
#define __SYSCTRL_RTC_RST_DISABLE() REGBITS_SET(CW_SYSCTRL->APBRST2, SYSCTRL_APB2_PERIPH_RTC)

#define SYSCTRL_MCO_DIV1 (0x00U)
#define SYSCTRL_MCO_DIV2 ((uint8_t)(0x01U << SYSCTRL_MCO_DIV_Pos))
#define SYSCTRL_MCO_DIV8 ((uint8_t)(0x02U << SYSCTRL_MCO_DIV_Pos))
#define SYSCTRL_MCO_DIV64 ((uint8_t)(0x03U << SYSCTRL_MCO_DIV_Pos))
#define SYSCTRL_MCO_DIV128 ((uint8_t)(0x04U << SYSCTRL_MCO_DIV_Pos))
#define SYSCTRL_MCO_DIV256 ((uint8_t)(0x05U << SYSCTRL_MCO_DIV_Pos))
#define SYSCTRL_MCO_DIV512 ((uint8_t)(0x06U << SYSCTRL_MCO_DIV_Pos))
#define SYSCTRL_MCO_DIV1024 ((uint8_t)(0x07U << SYSCTRL_MCO_DIV_Pos))

#define IS_SYSCTRL_MCO_DIV(INSTANCE) (((INSTANCE) == SYSCTRL_MCO_DIV1) ||   \
                                      ((INSTANCE) == SYSCTRL_MCO_DIV2) ||   \
                                      ((INSTANCE) == SYSCTRL_MCO_DIV8) ||   \
                                      ((INSTANCE) == SYSCTRL_MCO_DIV64) ||  \
                                      ((INSTANCE) == SYSCTRL_MCO_DIV128) || \
                                      ((INSTANCE) == SYSCTRL_MCO_DIV256) || \
                                      ((INSTANCE) == SYSCTRL_MCO_DIV512) || \
                                      ((INSTANCE) == SYSCTRL_MCO_DIV1024))

#define SYSCTRL_MCO_SRC_NONE (0x00U)
#define SYSCTRL_MCO_SRC_HCLK (0x01U)
#define SYSCTRL_MCO_SRC_PCLK (0x02U)
#define SYSCTRL_MCO_SRC_HSI (0x03U)
#define SYSCTRL_MCO_SRC_LSI (0x04U)
#define SYSCTRL_MCO_SRC_HSE (0x05U)
#define SYSCTRL_MCO_SRC_LSE (0x06U)

#define IS_SYSCTRL_MCO_SRC(INSTANCE) (((INSTANCE) == SYSCTRL_MCO_SRC_NONE) || \
                                      ((INSTANCE) == SYSCTRL_MCO_SRC_HCLK) || \
                                      ((INSTANCE) == SYSCTRL_MCO_SRC_PCLK) || \
                                      ((INSTANCE) == SYSCTRL_MCO_SRC_HSI) ||  \
                                      ((INSTANCE) == SYSCTRL_MCO_SRC_LSI) ||  \
                                      ((INSTANCE) == SYSCTRL_MCO_SRC_HSE) ||  \
                                      ((INSTANCE) == SYSCTRL_MCO_SRC_LSE))

#define RCC_HSE_FLT_CLOSE (0x00000000U)
#define RCC_HSE_FLT_OPEN (0x01000000U)
    //==================================================================================
    extern void SYSCTRL_HCLKPRS_Config(uint32_t HCLKPRS);
    extern void SYSCTRL_PCLKPRS_Config(uint32_t PCLKPRS);
    extern void SYSCTRL_SYSCLKSRC_Config(uint32_t SYSCLKSRC);
    extern void SYSCTRL_CCS_Config(uint32_t CCS, FunctionalState NewState);
    extern void SYSCTRL_LSELOCK_Config(uint32_t LSELOCK);
    extern void SYSCTRL_WAKEUPCLK_Config(uint32_t WAKEUPCLK);
    extern void SYSCTRL_LOCKUP_Config(uint32_t LOCKUP);
    extern void SYSCTRL_SWDIO_Config(uint32_t SWDIO);
    extern void SYSCTRL_BrakeConfig(uint32_t BrakeType, FunctionalState NewState);
    extern int SYSCTRL_DeInit(void);
    extern void SYSCTRL_SystemCoreClockUpdate(uint32_t NewFreq);
    extern int SYSCTRL_HSI_Enable(uint32_t HSIDiv);
    extern void SYSCTRL_HSI_Disable(void);
    extern int SYSCTRL_LSI_Enable(void);
    extern void SYSCTRL_LSI_Disable(void);
    extern void SYSCTRL_HSEWaitClockSet(uint32_t WaitClock);
    extern void SYSCTRL_HSEEnablePinPolSet(uint32_t Polarity);
    int SYSCTRL_HSE_Enable(uint32_t Mode, uint32_t FreqIn, uint8_t Driver, uint32_t Flt);
    void SYSCTRL_HSE_Disable(void);
    extern int SYSCTRL_LSE_Enable(uint32_t Mode, uint8_t Driver);
    extern void SYSCTRL_LSE_Disable(void);
    extern int SYSCTRL_SysClk_Switch(uint32_t NewClk);
    extern void SYSCTRL_ITConfig(uint32_t SYSCTRL_IT, FunctionalState NewState);
    extern ITStatus SYSCTRL_GetITStatus(uint32_t SYSCTRL_IT);
    extern void SYSCTRL_ClearITPendingBit(uint32_t SYSCTRL_IT);
    extern FlagStatus SYSCTRL_GetStableFlag(uint32_t SYSCTRL_STABLEFLAG);
    extern uint32_t SYSCTRL_GetAllStableFlag(void);
    extern void SYSCTRL_AHBPeriphClk_Enable(uint32_t Periph, FunctionalState NewState);
    extern void SYSCTRL_APBPeriphClk_Enable1(uint32_t Periph, FunctionalState NewState);
    extern void SYSCTRL_APBPeriphClk_Enable2(uint32_t Periph, FunctionalState NewState);
    extern void SYSCTRL_PeripheralsClkEnalbe(SYSCTRL_PeriphEnumTypeDef Periph, boolean_t _bool);
    extern void SYSCTRL_AHBPeriphReset(uint32_t Periph, FunctionalState NewState);
    extern void SYSCTRL_APBPeriphReset1(uint32_t Periph, FunctionalState NewState);
    extern void SYSCTRL_APBPeriphReset2(uint32_t Periph, FunctionalState NewState);
    extern void SYSCTRL_PeripheralsResetEnalbe(SYSCTRL_PeriphEnumTypeDef Periph, boolean_t _bool);
    extern FlagStatus SYSCTRL_GetRstFlag(uint32_t SYSCTRL_RSTFLAG);
    extern uint32_t SYSCTRL_GetAllRstFlag(void);
    extern void SYSCTRL_ClearRstFlag(uint32_t SYSCTRL_RSTFLAG);

    extern void SYSCTRL_PCLK_OUT(void);
    extern void SYSCTRL_MCO_OUT(uint8_t Source, uint8_t Div);

    extern uint32_t SYSCTRL_GetHClkFreq(void);
    extern uint32_t SYSCTRL_GetPClkFreq(void);

    extern void SYSCTRL_GotoSleep(void);
    extern void SYSCTRL_GotoDeepSleep(void);
    extern void SYSCTRL_ConfigSleepOnExit(FunctionalState state);

    // 清除复位标志
    extern void SYSCTRL_ClearResetFlags(void);

#ifdef __cplusplus
}
#endif

#endif /* __CW32L011_SYSCTRL_H */
